examples/falling_ellipse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       39700;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       39900;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       40100;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       40200;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       40300;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       60300;
    }
)

// ************************************************************************* //
